/*
Задание: Составить программу, определяющую для заданного значения X значение
         Y по периодическому фрагменту, который представлен на рисунке ниже
		 (в коде или в выводе программы).
         Автор: Кутепов Пётр, группа 4354, 19.09.2024.

		 Контрольный пример: для a = -2     для a = 5
		                         b = -7         b = 5
								 x = -30.5      x = 15      
								 y = 1.75       y = -10
*/



#include <math.h>
#include <stdio.h>
#include <iostream>
#include <cmath>
using namespace std;

int main()
{
	setlocale(LC_ALL, "RU");

	double inpx, a, b, x, y;
	cout << "Задание: Составить программу, определяющую для заданного значения X значение ";
	cout << "Y по периодическому фрагменту, который представлен на рисунке ниже:\n";
	cout << "Автор: Кутепов Пётр, группа 4354, 19.09.2024.\n\n";
	cout << "   Y ^\n";
	cout << "     |\n";
	cout << "  +B |                 :.                .:.\n";
	cout << "     |               ::==                =#\n";
	cout << "     |             ::   -:              .=-*\n";
	cout << "     |    +A     ::      +              *  .=\n";
	cout << "     |      \\ ::         +            +    -.\n";
	cout << "  _0_|_______-#___________:+__________=-_____*_____________:%=:_________=*____________>\n";
	cout << "     |      .=             =.         +      .+           .=- .-.      .+-:            X\n";
	cout << "     |     :-               +        +        --         :=     .::   .+  +\n";
	cout << "     |    :-                .=      =.         =        :-         ::.+.  .+\n";
	cout << "     |   --                  =-    :=          .+      -=            =+    :=\n";
	cout << "  -B |  --                    +    +            :-    --                    =.\n";
	cout << "     | -:                      *.:+.             =:  -:                      +\n";
	cout << "     |-:                       :=+-               +:-:                       :=\n";
	cout << "     *-                         +*                :#-                         +-\n";
	cout << "     |\n";
	cout << "\n";
    
	printf("Введите значение A: ");
	cin >> a;
	printf("Введите значение B: ");
	cin >> b;
	printf ("Введите значение X: ");
	cin >> inpx;

	if (a != 0) {
		x = inpx / a;

		if (x < 0) {
			x = 8 + fmod(x, 8.0);
		}
		else {
			x = fmod(x, 8.0);
		}

		if (x >= 0 && x <= 1) {
			y = 2 * x - 2;
			y = y * b;
		}
		else if (x >= 1 && x <= 2) {
			y = x - 1;
			y = y * b;
		}
		else if (x >= 2 && x <= 3) {
			y = -3 * x + 7;
			y = y * b;
		}
		else if (x >= 3 && x <= 4) {
			y = 3 * x - 11;
			y = y * b;
		}
		else if (x >= 4 && x <= 5) {
			y = -3 * x + 13;
			y = y * b;
		}
		else if (x >= 5 && x <= 6) {
			y = 2 * x - 12;
			y = y * b;
		}
		else if (x >= 6 && x <= 7) {
			y = -x + 6;
			y = y * b;
		}
		else if (x >= 7 && x <= 22.0 / 3.0) {
			y = 3 * x - 22;
			y = y * b;
		}
		else if (x >= 22.0 / 3.0 && x <= 8) {
			y = -3 * x + 22;
			y = y * b;
		}
		cout << "Для X, равного = " << inpx << ", при значениях A = " << a << " и B = " << b << ", значение Y равно = " << y;
	}
	else {
		cout << "Для X, равного = " << inpx << ", при значениях A = " << a << " и B = " << b << ", значение Y равно = [" << -2.0 * b << ";" << 1.0 * b << "].";
	}
	cout << "\n\n\n";
}
